#### Terraform Format and Style 🖌`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

random_id.random: Refreshing state... [id=_m0SSQ]
google_service_account.org_policy_compare_sa: Refreshing state... [id=projects/orgpolicy-notifier/serviceAccounts/org-policy-compare-dev@orgpolicy-notifier.iam.gserviceaccount.com]
module.pubsub_scheduled_example.module.main.null_resource.dependent_files: Refreshing state... [id=2431744087259537940]
google_storage_bucket.policy_bucket: Refreshing state... [id=orgpolicy-notifier-policy-bucket-fe6d1249-dev]
module.pubsub_scheduled_example.module.main.data.null_data_source.wait_for_files: Refreshing state...
module.pubsub_scheduled_example.module.main.data.archive_file.main: Refreshing state...
module.pubsub_scheduled_example.module.main.google_storage_bucket.main: Refreshing state... [id=orgpolicy-notifier-cfn-bucket-fe6d1249-dev]
module.pubsub_scheduled_example.module.pubsub_topic.google_pubsub_topic.topic[0]: Refreshing state... [id=projects/orgpolicy-notifier/topics/orgpolicy-notifier-topic-dev]
module.pubsub_scheduled_example.module.main.google_storage_bucket_object.main: Refreshing state... [id=orgpolicy-notifier-cfn-bucket-fe6d1249-dev-18a3c753c7841dd7d326bf2c0200bda8-src.zip]
module.pubsub_scheduled_example.google_cloud_scheduler_job.job[0]: Refreshing state... [id=projects/orgpolicy-notifier/locations/us-central1/jobs/orgpolicy-notifier-job-fe6d1249-dev]
module.pubsub_scheduled_example.module.main.google_cloudfunctions_function.main: Refreshing state... [id=projects/orgpolicy-notifier/locations/us-central1/functions/orgpolicy-notifier-fe6d1249-dev]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_organization_iam_custom_role.org_policy_compare_custom_role will be created
  + resource "google_organization_iam_custom_role" "org_policy_compare_custom_role" {
      + deleted     = (known after apply)
      + description = "IAM role for Cloud Function to Compare Org Policies"
      + id          = (known after apply)
      + name        = (known after apply)
      + org_id      = "948721840059"
      + permissions = [
          + "orgpolicy.policy.get",
          + "resourcemanager.projects.get",
          + "resourcemanager.projects.list",
          + "secretmanager.secrets.get",
          + "secretmanager.versions.access",
          + "secretmanager.versions.get",
          + "storage.objects.create",
          + "storage.objects.delete",
          + "storage.objects.get",
          + "storage.objects.list",
          + "storage.objects.update",
        ]
      + role_id     = "org_policy_compare_cfn_dev"
      + stage       = "GA"
      + title       = "Organization Policy Function Role"
    }

  # google_organization_iam_member.org_policy_compare_member will be created
  + resource "google_organization_iam_member" "org_policy_compare_member" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:org-policy-compare-dev@orgpolicy-notifier.iam.gserviceaccount.com"
      + org_id = "948721840059"
      + role   = "organizations/948721840059/roles/org_policy_compare_cfn_dev"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @iloveicedgreentea, Action: `pull_request`, Working Directory: ``, Workflow: `Development environment checks and Terraform`*